# Лабораторная работа №1 по дисциплине ЛОИС
# Выполнена студентами группы 421702 Бурбасом Дмитрием Юрьевичем и
# Башурой Артемом Олеговичем
#
# Файл основных базовых операций нечеткой логики необходимых для
# выполнения лабораторной (треугольная норма граничного произведения, импликация Лукаcевича)
# 27.09.2026
# Источники:
# TODO: Написать источники


def bounded_product_t_norm(value1: float, value2: float) -> float:
    """
    Функция расчета треугольной нормы(нечеткой конъюнкции)
    граничного произведения для значений функции принадлежности.

    Формула расчета: T(x,y) = max(0.0, x + y - 1.0), где x и y — элементы
    отрезка [0,1].

    :param value1: первый операнд треугольной нормы
    :type value1: float
    :param value2: второй операнд треугольной нормы
    :type value2: float
    :rtype: float
    """
    return max(0.0, value1 + value2 - 1.0)


def lukasevich_implication(value1: float, value2: float) -> float:
    """
    Функция расчета импликации Лукаcевича для значений
    функции принадлежности.

    Формула расчета: I(x,y) = min(1.0,1.0 - x + y), где x и y — элементы
    отрезка [0,1].

    :param value1: анцедент импликации
    :type value1: float
    :param value2: консеквент импликации
    :type value2: float
    :rtype: float
    """
    return min(1.0, 1.0 - value1 + value2)
